package equipment

// Define equipment sets and rankings

var EquipmentSets = map[string]map[string]struct{}{
	"天尊套":   {"天尊头盔": {}, "天尊项链": {}, "天尊手镯": {}, "天尊戒指": {}, "天尊腰带": {}, "天尊道靴": {}},
	"天之天尊套": {"天之天尊头盔": {}, "天之天尊项链": {}, "天之天尊手镯": {}, "天之天尊戒指": {}, "天之天尊腰带": {}, "天之天尊道靴": {}},
	"天玄套":   {"天玄头盔": {}, "天玄项链": {}, "天玄手镯": {}, "天玄戒指": {}, "天玄腰带": {}, "天玄道靴": {}},
	"天之天玄套": {"天之天玄头盔": {}, "天之天玄项链": {}, "天之天玄手镯": {}, "天之天玄戒指": {}, "天之天玄腰带": {}, "天之天玄道靴": {}},
	"封雷套":   {"封雷手镯": {}, "封雷戒指": {}},
	"金刚套":   {"金刚手镯": {}, "金刚戒指": {}, "金刚项链": {}},
	"御灵套":   {"御灵手镯": {}, "御灵戒指": {}, "御灵项链": {}, "御灵腰带": {}, "御灵靴子": {}},
	"祝福套":   {"祝福手镯": {}, "祝福戒指": {}, "祝福项链": {}},
	"道神套":   {"道神头盔": {}, "道神项链": {}, "道神手镯": {}, "道神戒指": {}, "道神腰带": {}, "道神靴子": {}},
	"幽泉套":   {"幽泉头盔": {}, "幽泉项链": {}, "幽泉手镯": {}, "幽泉戒指": {}, "幽泉腰带": {}, "幽泉靴子": {}},
	"法神套":   {"法神头盔": {}, "法神项链": {}, "法神手镯": {}, "法神戒指": {}, "法神腰带": {}, "法神靴子": {}},
	"天之法神套": {"天之法神头盔": {}, "天之法神项链": {}, "天之法神手镯": {}, "天之法神戒指": {}, "天之法神腰带": {}, "天之法神道靴": {}},
	"幻魔套":   {"幻魔头盔": {}, "幻魔项链": {}, "幻魔手镯": {}, "幻魔戒指": {}, "幻魔腰带": {}, "幻魔法靴": {}},
	"天之幻魔套": {"天之幻魔头盔": {}, "天之幻魔项链": {}, "天之幻魔手镯": {}, "天之幻魔戒指": {}, "天之幻魔腰带": {}, "天之幻魔法靴": {}},
	"天机套":   {"天机项链": {}, "天机手镯": {}, "天机戒指": {}},
	"圣战套":   {"圣战头盔": {}, "圣战项链": {}, "圣战手镯": {}, "圣战戒指": {}, "圣战腰带": {}, "圣战靴子": {}},
	"天之圣战套": {"天之圣战头盔": {}, "天之圣战项链": {}, "天之圣战手镯": {}, "天之圣战戒指": {}, "天之圣战腰带": {}, "天之圣战靴子": {}},
	"神武套":   {"神武头盔": {}, "神武项链": {}, "神武手镯": {}, "神武戒指": {}, "神武腰带": {}, "神武战靴": {}},
	"天之神武套": {"天之神武头盔": {}, "天之神武项链": {}, "天之神武手镯": {}, "天之神武戒指": {}, "天之神武腰带": {}, "天之神武战靴": {}},
	"疾风套":   {"疾风项链": {}, "疾风手镯": {}, "疾风戒指": {}},
	"魔神套":   {"魔神头盔": {}, "魔神项链": {}, "魔神手镯": {}, "魔神戒指": {}, "魔神腰带": {}, "魔神靴子": {}},
	"战神套":   {"战神头盔": {}, "战神项链": {}, "战神手镯": {}, "战神戒指": {}, "战神腰带": {}, "战神靴子": {}},
	"帝释套":   {"帝释头盔": {}, "帝释腰带": {}},
	"血煞套":   {"血煞头盔": {}, "血煞项链": {}, "血煞手镯": {}, "血煞戒指": {}, "血煞腰带": {}, "血煞靴子": {}},
	"魔雷套":   {"魔雷头盔": {}, "魔雷项链": {}, "魔雷手镯": {}, "魔雷戒指": {}, "魔雷腰带": {}, "魔雷靴子": {}},
}

var EquipmentRank = map[string]int{ // higher is stronger
	"御灵套": 100,
	"幽泉套": 90, "魔雷套": 90, "血煞套": 90,
	"魔神套": 85, "战神套": 85, "道神套": 85,
	"天玄套": 80, "幻魔套": 80, "神武套": 80, "天之神武套": 80, "天之幻魔套": 80, "天之天玄套": 80,
	"圣战套": 70, "法神套": 70, "天尊套": 70, "天之圣战套": 70, "天之法神套": 70, "天之天尊套": 70,
	"封雷套": 60, "祝福套": 60,
	"天机套": 50, "疾风套": 50, "金刚套": 50, "帝释套": 50,
}
